backend/app/controllers/divisions_controller.rb

SELECT "divisions".* FROM "divisions"
---
    def index
        division = Division.all