backend/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
    def index
        player = Player.all

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "players" SET "position" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["position", "b"], ["updated_at", "2022-12-09 03:57:40.729159"], ["id", 26]]
---
    def update
        player = Player.find_by!(id: params[:id])
        player.update!(player_position)

INSERT INTO "players" ("name", "image", "position", "age", "country", "goals", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        player = Player.create!(players_params)

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 26]]
---
    def destroy
        player = Player.find_by!(id: params[:id])
        player.destroy