backend/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
    def index
        team = Team.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        team = Team.find(params[:id])

INSERT INTO "teams" ("name", "mascot", "standing", "top_scorer", "team_captin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "a"], ["mascot", "a"], ["standing", nil], ["top_scorer", ""], ["team_captin", ""], ["created_at", "2022-12-09 18:15:50.896801"], ["updated_at", "2022-12-09 18:15:50.896801"]]
---
    def create
        team = Team.create!(teams_params)