backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "a"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-06 19:14:47.380015"], ["updated_at", "2022-12-06 19:14:47.380015"]]
---
 def create
  user = User.create(user_params)